InformationRegisters/ОбращенияПокупателейОтветыПроизводителейНаВключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОбращенияПокупателейОтветыПроизводителейНаВключения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоступленияРекламации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеТехнологическогоПроцессаВключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущиеМетодыКонтроляДанногоНарушения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятыеМерыМетодыКонтроляПослеНарушения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпределениеКонтрольныхТочекНарушения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействияПриПовторенииНарушения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаПроизводствеУстановленаВидеоФиксация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьНаблюдениеЗаКонтрольнойТочкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируетсяВнедрениеВидеонаблюденияЗаКонтрольнойТочкой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрикреплённыеФайлы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПрикреплённыхФайлов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВключенияОписаниеПостороннегоПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПопаданияПостороннегоВключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазработанныеПрограммыПредварительныхМероприятий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемыеКорректирующиеДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заполнил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗамечаниеНаДоработку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияЗамечанийНаДоработку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>id_OK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID_Загрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бланк</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбращенияПокупателейОтветыПроизводителейНаВключения/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//+++АК SHEP 2018.07.02 ИП-00018753.04
	//ТолькоПросмотр = Истина;
	СтруктураПараметры = Новый Структура("Номенклатура,Производитель,ТипОбращения,ТипЖалобы,ТипВключения");
	ЗаполнитьЗначенияСвойств(СтруктураПараметры, Параметры);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураПараметры);
	//---АК SHEP 2018.07.02
	
	Элементы.ФормаПрикреплённыеФайлы.Заголовок = ЗаголовокПрикреплённыхФайлов(Запись.ПрикреплённыеФайлы);
	
	//+++АК SHEP 2018.07.30
	Если НЕ ПустаяСтрока(Запись.ИсторияЗамечанийНаДоработку) Тогда
		ИсторияЗамечанийНаДоработку.Загрузить(ЗначениеИзСтрокиВнутр(Запись.ИсторияЗамечанийНаДоработку));
	КонецЕсли;
	//---АК SHEP 2018.07.30

КонецПроцедуры

//+++АК SHEP 2018.07.02 ИП-00018753.04
&НаКлиенте
Процедура ПрикреплённыеФайлы(Команда)
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("ПрикреплённыеФайлыЗавершение", ЭтаФорма);
	ПараметрыОткрываемойФормы = Новый Структура("ТабФайлов,ТолькоПросмотр,ЭтоОтветПроизводителя", Запись.ПрикреплённыеФайлы, ТолькоПросмотр, Истина);
	ОткрытьФорму("РегистрСведений.ОбращенияПокупателей.Форма.ФормаПрикрепленныхФайлов", ПараметрыОткрываемойФормы, ЭтаФорма, УникальныйИдентификатор,,, ОповещениеЗавершения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикреплённыеФайлыЗавершение(ЗначениеВозврат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ЗначениеВозврат) Тогда
		Запись.ПрикреплённыеФайлы = ЗначениеВозврат;
		Элементы.ФормаПрикреплённыеФайлы.Заголовок = ЗаголовокПрикреплённыхФайлов(ЗначениеВозврат);
	КонецЕсли;
	
КонецПроцедуры

//+++АК SHEP 2018.07.26 ИП-00018753.03
&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокПрикреплённыхФайлов(ТабФайлов)
	
	Если ПустаяСтрока(ТабФайлов) Тогда
		КвоФайлов = 0;
	Иначе
		КвоФайлов = КвоСтрокТЗнИзСтрокиВнутр(ТабФайлов);
	КонецЕсли;
	
	Возврат "Прикреплённые файлы (" + Формат(КвоФайлов, "ЧН=нет; ЧГ=") + ")";
	
КонецФункции

//+++АК SHEP 2018.07.26 ИП-00018753.03
&НаСервереБезКонтекста
Функция КвоСтрокТЗнИзСтрокиВнутр(ТабФайлов)
	
	ТабДанные = ЗначениеИзСтрокиВнутр(ТабФайлов);
	Возврат ТабДанные.Количество();
	
КонецФункции

//+++АК SHEP 2018.07.30 ИП-00018753.03
&НаКлиенте
Процедура ОтправитьНаДоработку(Команда)
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("ОтправитьНаДоработкуЗавершение", ЭтаФорма);
	ПоказатьВводСтроки(ОповещениеЗавершения, Запись.ЗамечаниеНаДоработку, "Введите текст замечания", 200, Истина);
	
КонецПроцедуры

//+++АК SHEP 2018.07.30 ИП-00018753.03
&НаКлиенте
Процедура ОтправитьНаДоработкуЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	
	Запись.ЗамечаниеНаДоработку = Результат;
	
	Если ОтправитьНаДоработкуНаСервере() Тогда
		Закрыть();
	Иначе
		ПоказатьПредупреждение(, "Не существует аналогичного обращения покупателя!");
	КонецЕсли;
	
КонецПроцедуры

//+++АК SHEP 2018.07.30 ИП-00018753.03
&НаСервереБезКонтекста
Функция ДобавитьВИсториюЗамечанийНаДоработку(ТЗнЗамечанияНаДоработку, ЗамечаниеНаДоработку)
	
	НоваяСтрокаТЗн = ТЗнЗамечанияНаДоработку.Добавить();
	НоваяСтрокаТЗн.ДатаДобавления = ТекущаяДата();
	НоваяСтрокаТЗн.Пользователь = ОбщегоНазначенияПовтИсп.ТекущийПользовательСеанса();
	НоваяСтрокаТЗн.Замечание = ЗамечаниеНаДоработку;
	
	Возврат ЗначениеВСтрокуВнутр(ТЗнЗамечанияНаДоработку);
	
КонецФункции

//+++АК SHEP 2018.07.30 ИП-00018753.03
&НаСервере
Функция ОтправитьНаДоработкуНаСервере()
	
	СтруктураДанныеОтбор = Новый Структура("id_OK,GUID_Загрузки,ДатаДок");
	ЗаполнитьЗначенияСвойств(СтруктураДанныеОтбор, Запись);
	
	МенеджерЗаписиОбращенияПокупателей = РегистрыСведений.ОбращенияПокупателей.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписиОбращенияПокупателей, СтруктураДанныеОтбор);
	МенеджерЗаписиОбращенияПокупателей.Прочитать();
	
	Если НЕ МенеджерЗаписиОбращенияПокупателей.Выбран() Тогда Возврат Ложь; КонецЕсли;
	
	Запись.ИсторияЗамечанийНаДоработку = ДобавитьВИсториюЗамечанийНаДоработку(РеквизитФормыВЗначение("ИсторияЗамечанийНаДоработку"), Запись.ЗамечаниеНаДоработку);
	Записать();
	МенеджерЗаписиОбращенияПокупателей.ОтветПроизводителя = "";
	МенеджерЗаписиОбращенияПокупателей.Записать();
	
	Возврат Истина;
	
КонецФункции
